/* მოგესალმებით მეგობრებო ეს არის დავალება ნომერი 1. დავალების ყველა ეტაპი აღწერილია კომენტარის სახით
 * 1) კომენტარები
 * 2) ცვლადები
 * 3) მონაცემთა ტიპები
 * 4) ოპერატორები და არითმეტიკა
 */



// 1 კომენტარები

/*
  // კომენტარები გაფუჭდა თქვენი დავალებაა
  // არასწორად დაწერილი კომენტარი ჩაასწოროთ
  // და ასევე გამოიყენოთ თქვენი კოდის აღსაწერად
*/

// არსებობს ორი სახის კომენტარი

// 1. ერთხაზიანი და /* */ მრავალ ხაზიანი



// 2 ცვლადები

/*
  // მსურს ჩემი Spotify ლისტის განახლება 
  // ამაში კი თქვენი დახმარება მჭირდება
  // აღწერეთ თქვენი საყვარელი მომღერლის
  // (სახელი, გვარი, ასაკი, დაბადების წელი, დაბადების ადგილი,)
  // გაითვალისწინეთ რომ ამისთვის უნდა
  // გამოიყენოთ მხოლოდ (const, let)
  // (ნებისმიერი პიროვნების ჩაწერა შეგიძლიათ)
*/

// >>>> კოდი დაწერეთ აქ
const firstName = 'Giorgi';
const lastName = 'Ilariani';
let myAge = 18;
const myBirthDay = 2003;
const myBirthPlace = 'Gori';
const myFavouriteSonger = 'Eminem';
let myGoal = 'become software developer';


// let - ის მნიშვნელობის შეცვლა შეიძლება
// const - ის მნიშვნელობის შეცვლა არ შეიძლენა


// 

/*
  // დროა დავიწყოთ მზადება ჩვენს მომავალ პროექტზე.
  // ჩვენი დავალეებაა მოვიფიქროთ რაიმე პროდუქტთა სია
  // რომელსაც გამოვიყენებთ მომავალში.

  წიგნების მაღაზიის მაგალითი:

  const BookName = "ვეფხისტყაოსანი";
  const AuthrName = "შოთა რუსთაველი";
  const CreateDate = "13 საუკუნე";
  let ProductQuant = 124;
*/


// >>>> კოდი დაწერეთ აქ
const carName = 'Mercedes';
const bestModel = 'C63 black series';
const horsePower = 500 +'+';
let myGoaal = 'buy even C350 ;D';

//



// 3 მონაცემთა ტიპები

/*
  // აქ რაღაც შეცდომაა თქვენი დავალებაა ცვლადის გამოცხადების
  // დროს გაასწოროთ შეცდომა;
*/



const age = 1;
const hisName = "bob";
const isHigh = true;
const dateOfBirth = 1995;




// ეს კოდი ამოწმებს თქვენ მიერ მითითებულ ტიპებს

// თქვენი მიზანია დააბრუნოთ პირველი 4 true

console.log(typeof age === number);
console.log(typeof hisName === string);
console.log(typeof isHigh === boolean);
console.log(typeof dateOfBirth === number);
// სამი ტოლობის ნიშანი არის მკაცრი ,,უდრის"   ამიტომ მაგ:  1 არ უდრის '1';  მაშასადამე ვერ დააბრუნებს true-ს; 


// აქ უნდა გაიგოთ თქვენი პროდუქტის სიის ტიპი

// მაგ: console.log(typeof age)
console.log(typeof age);
console.log(typeof hisName);
console.log(typeof isHigh);
console.log(typeof dateOfBirth);



// ოპერატორები არითმეტიკა

let num = 5;

// გამოიყენეთ ყველა ვარიანტი რომლითაც შეგვიძლია ამ ციფრის გაზრდა

// >>> კოდი დაწერეთ აქ

num += 3;   // მიმატების ხერხი
num *= 3;  // გამრავლების ხერხი
num ** 3;  // ახარისხების ხერხი

//

console.log(num)



// სცადეთ შეკრიბოთ განსხვავებული ტიპის მქონე 
// მნიშვნელობები და გაიგოთ შეკრებილი მონაცემების ტიპი

// >>> კოდი დაწერეთ აქ
let a = 10;
let b = 15;

let c = a + b;   // c = 10 + 15 =25
let d = a * b    // d = 10 * 15 = 150'
let e = a ** b   // 10 ხარისხად 15;
// 